<?php
    echo "Hello world!"; //вывод текста
    echo"<br>";
    //print "";
    //print_r(expression: "Name $s", $s);
    // в одну строку
    # в одну строку
    /*комментарий в неск строк*/
    $var =1;
    $var1 =2;
    echo $var . $var1; //12
    echo"<br>"; //перенос эхо на строку следующую
    echo $var + $var1; //3
    echo '<a href="">'; //то что вывыодим через ковычки, помещаем в одинарные, либо экранирование ниже
    echo "<a href=\" \">"; //экранирование
?>

<!--<a href="/url/"<?php /*echo "url"; */?></a>-->